$(function () {
    var u = navigator.userAgent, app = navigator.appVersion;
    var isiOS = !!u.match(/\(i[^;]+;( U;)? CPU.+Mac OS X/); //ios终端
    function scrollBottom() {
        window.scrollTo(0, $('body').height() + 90);
    }
    $('#askinput').focus(function () {
        if (isiOS) {
            window.setTimeout(function(){
                scrollBottom()
            }, 500);
        }
    });

    var data = [
        {'title':'特色财务指标运用 周期共振的基本原理','id':'f4c55003e0','imgUrl':'bee1466477573565.jpg','time':'11:42','name':'姜城芳'},
        {'title':'李萤的价值投资：价值投资者需要的态度','id':'5a3f8d6684','imgUrl':'bee1462500269801.jpg','time':'11:31','name':'李莹'},
        {'title':'生命k线：断头铡刀','id':'aa5c28b8db','imgUrl':'bee1453346896012.jpg','time':'14:16','name':'南松'},
        {'title':'龙虎榜秘籍：从龙虎榜中找投资机会','id':'8d9548549e','imgUrl':'bee1453348004269.jpg','time':'11:07','name':'张姚'},
        {'title':'李萤的价值投资：四维投资方法应用','id':'d6ceafe384','imgUrl':'bee1462500247966.jpg','time':'10:52','name':'李莹'},
        {'title':'N倍牛股寻找技巧','id':'8aee55a1cb','imgUrl':'bee1460699608261.jpg','time':'15:01','name':'袁建新'},
        {'title':'黄金波浪理论：跟我一起来数浪','id':'aea66de5b2','imgUrl':'bee1463984032365.jpg','time':'12:14','name':'余炜'},
        {'title':'三招选白马','id':'303803baa6','imgUrl':'bee1458199565988.jpg','time':'10:08','name':'徐世荣'},
        {'title':'龙虎榜秘籍：第一讲如何理清交易席位','id':'a2b29b77a4','imgUrl':'bee1458885307228.jpg','time':'36:50','name':'张姚'},
        {'title':'《黄金波浪战法》第一课投资股票是王道','id':'27ab1a3680','imgUrl':'bee1460360760877.jpg','time':'42:27','name':'余炜'},
        {'title':'告诉你机构做盘的秘密 第一课 市值管理中的投资机会','id':'0479fd508e','imgUrl':'bee1467376986381.jpg','time':'68:11','name':'沈阳'},
        {'title':'主题投资第一课——超额收益的法宝','id':'c0bbf4af07','imgUrl':'bee1467209269466.jpg','time':'60:28','name':'杨风'}
                ];
    var result= [
        [
            {'name':'游客5526','time':'08-11  15:36','content':'星网锐捷002396 请问老师 该股如果从长线来看 还能不能反弹到26这个点 我是25多被套 如果能够长线解套 我就安心等待'},
            {'name':'游客3356','time':'08-02  18:20','content':'炒股要看大势；昨天的暴跌对市场的心理情绪冲击很大。今天上午主力狂拉沪深300；稳定了市场情绪；','replay':'这个情况下，首先需要控制仓位，抱着短线的心态看待市场；'},
            {'name':'游客2511','time':'07-30  09:30','content':'请问老师隆基机械我二十二元的成本现已套，请问老师如何操作'},
            {'name':'游客4674','time':'07-25  22:23','content':'技术面角度 8.8-9.5元之间是重要的支撑区间；跟踪该区间主力的运作；可否形成有效的支撑；','replay':'目前，手头有现金适宜先现金为王；等待大盘企稳，再择机入市；'},
            {'name':'游客4532','time':'07-10  12:36','content':'技术面跌破M250天，年线；这个情况下，是思考年线如果支撑不住的话，是否止损的问题，而非加仓的问题；','replay':'先跟踪好，看看年线的支撑效果，如果有效的话，再考虑加仓也不晚；'},
            {'name':'游客7242','time':'07-10  19:30','content':'能不能帮忙看下柳化股份哦，满仓哦','replay':'这个标的市值也不大，可以拿着等待市场的企稳'},
            {'name':'游客1254','time':'07-02  17:33','content':'老师，中国中车8号复牌了，你看好吗？','replay':'就是看量，有量做下，没量休息'},
            {'name':'游客7862','time':'06-28  17:12','content':'兆日科技 此股有大股东减持消息出来，应该清仓么？','replay':'散户不建议做T的，老老实实博弈下市场的情绪'},

        ],
        [
            {'name':'游客1526','time':'08-12  11:36','content':'老师 麻烦看看中泰化学8.0成本，亏损八个点，明天可以补仓做t吗？多少价位价位补？还有 双塔食品怎么样 今天它的负乖离达到-37了，明天要是跌停，可以小仓位进一点吗？'},
            {'name':'游客5356','time':'08-10  16:22','content':'龙头股份 预期走势如何','replay':'散户不建议做T的，老老实实博弈下市场的情绪'},
            {'name':'游客4511','time':'07-31  09:30','content':'老师 盘江股份是不是主力在疯狂抛售？'},
            {'name':'游客0674','time':'07-28  22:23','content':'000518江南红箭为什么今天跌停了？'},
            {'name':'游客5532','time':'07-18  19:30','content':'焦点科技80的本看中高送转，有实现可能吗？','replay':'不建议补仓，等待市场企稳后'},
            {'name':'游客3242','time':'07-18  22:16','content':'正泰电器601877 还可以拿吗？，亏了二十个点了，谢谢各位老师!支撑价和压力价是多少。'},
            {'name':'游客2254','time':'07-01  17:33','content':'浙江东日600113 现在大盘调整结束了吗？113什么时候可以反弹到15啊？现在是假底现象吗？又是挖坑吧不会'},
            {'name':'游客1862','time':'06-28  15:12','content':'老师好，重工深套50%，这支股票怎么操作？求老师帮忙指点。谢谢。'},
            {'name':'游客1525','time':'06-28  11:10','content':'物产中大和浙江众成哪个好点？中期看！','replay':'持股继续观望'},
            {'name':'游客7582','time':'06-20  15:46','content':'华菱钢铁000932、 4.7的本，怎么操作','replay':'目前钢铁行业是个产能严重过剩的行业，淘汰落后产能将是该行业的主基调，个人认为钢铁行业没有找到明确的兼并重组题材的 就不要参与了'},
            {'name':'游客0525','time':'06-19  11:10','content':'康强电子002119 19.61的本，近期有机会吗？继续持有吗'},
            {'name':'游客0582','time':'06-19  19:46','content':'比亚迪002594 比亚迪还亏2个点，请问明天怎么操作'},
        ],
        [
            {'name':'游客5526','time':'08-11  10:35','content':'烽火通信600498 老师连着两个跌停板了，明天怎么操作'},
            {'name':'游客5356','time':'08-01  19:29','content':'600549 今日如何操作？成本19，半仓.','replay':'表现不佳，只能等'},
            {'name':'游客4521','time':'07-23  09:30','content':'002622 33元的股本还可以拿吗今天会涨吗谢谢'},
            {'name':'游客0674','time':'07-22  20:20','content':'603818老师，请问这股何时可以补，现在被套30点'},
            {'name':'游客5102','time':'07-20  19:54','content':'华电国际 6.88的成本还可以拿吗'},
            {'name':'游客3242','time':'07-19  18:16','content':'000793华闻传媒资金情况如何？','replay':'先拿着吧，也没多大的反弹'},
            {'name':'游客4582','time':'06-20  19:12','content':'601058赛轮金宇大单流入很多 但是怕补跌 现在还能持有么？'},
        ],
        [
            {'name':'游客8526','time':'08-09  13:36','content':'浙江东日 今天大盘会反弹吗？'},
            {'name':'游客5356','time':'08-02  16:22','content':'博汇纸业可以买进吗'},
            {'name':'游客2011','time':'07-29  04:30','content':'中海集运今天可以买吗？','replay':'不买进，市场还未企稳'},
            {'name':'游客0674','time':'07-22  22:25','content':'今天会跌破3000点'},
            {'name':'游客5432','time':'07-18  19:30','content':'鑫科材料 接下来会怎么走'},
            {'name':'游客5542','time':'07-18  19:16','content':'钱江水利今天可以补仓吗？'},
            {'name':'游客2254','time':'07-01  16:33','content':'欧菲光 老师这个股怎么样 什么价位可以进入'},
            {'name':'游客5212','time':'06-28  19:22','content':'江山化工会不会反弹','replay':'目前大行情不是太稳定，适合轻仓 T+0 操作'},
            {'name':'游客2114','time':'07-01  11:33','content':'老师 新华百货今天跌破上升趋势线了，31的成本，割肉吗'},
            {'name':'游客1862','time':'07-01  18:12','content':'002501 14元的本，现在可以补仓吗？'},
            {'name':'游客0755','time':'06-28  15:12','content':'600113又一个跌停，什么时候才开始上涨啊，亏死了，15成本还能解套不？'},
            {'name':'游客0255','time':'06-22  19:33','content':'佛慈制药，，海鸥卫浴，恒逸石化后期走势如何','replay':'短期无量反弹，先拿走，估计有有个脉冲行情，这是乐观的看法'},
            {'name':'游客4522','time':'06-19  11:10','content':'老师您好，雄韬股份大股东减持是不是后市堪忧？','replay':'都不好，最好关注那些 底部调整过后开始放量的'},
            {'name':'游客4522','time':'06-19  18:40','content':'请问300276后市如何，明天该出吗'},
        ],
        [
            {'name':'游客5226','time':'08-12  11:36','content':'铜陵有色我3.23进，要近期怎么操作，要出吗？'},
            {'name':'游客1206','time':'08-07  16:22','content':'601099 配股前需要补仓降低成本吗？谢谢','replay':'该股目前还不是机会，不要去赌反弹，等形态走出来后再参与，做右侧交易'},
            {'name':'游客5221','time':'07-31  09:30','content':'你好！600855后期怎样操作？谢谢！'},
            {'name':'游客5224','time':'07-28  22:25','content':'请问600240华业地产后势？'},
            {'name':'游客5532','time':'07-18  19:30','content':'振华重工可以进仓吗，有没上涨空间','replay':'这个标的还可以的，市场企稳后会有表现得'},
            {'name':'游客5222','time':'07-18  22:16','content':'中体产业 后期会咋样'},
            {'name':'游客8994','time':'07-01  17:33','content':'内蒙华电和国电电力后市如何操作?','replay':'先观望下，目前还没调整到位，底部形态尚未走出来'},
            {'name':'游客5635','time':'06-19  11:10','content':'浙富控股 下午怎么样，老师给看看'},
            {'name':'游客0542','time':'06-19  19:40','content':'中国重工可以补仓吗'},
        ],
        [
            {'name':'游客4526','time':'08-08  12:12','content':'抚顺特钢还能持有吗，老师'},
            {'name':'游客8556','time':'08-03  16:10','content':'请问余炜老师和袁建新老师的微信号和信箱是多少，请告知，谢谢！'},
            {'name':'游客9611','time':'08-08  09:01','content':'600085和601727上海电气这两票中线可持有吗？谢谢','replay':'市值也不大，可持有'},
            {'name':'游客0334','time':'07-28  09:28','content':'002505 下方史撑位多少。'},
            {'name':'游客5552','time':'07-18  19:18','content':'登海种业 现在可以卖进吗'},
            {'name':'游客3002','time':'07-18  08:18','content':'可叹600094大名城害死了多少散户啊！'},
            {'name':'游客2774','time':'07-01  13:11','content':'老师，请回600156已吃了3个跌停板，后市该如何操作，','replay':'不买进，市场还未企稳'},
            {'name':'游客9962','time':'06-28  15:18','content':'老师 兔宝宝现在可以持有么？'},
            {'name':'游客0525','time':'06-19  12:19','content':'珠江实业 和雄韬股份能做T吗老师'},
            {'name':'游客0332','time':'06-19  10:19','content':'宗申动力001696后市如何？谢谢老师','replay':'趋势没有明朗，今天不做买入   可以逢大跌小仓位买'},
        ],
        [
            {'name':'游客8566','time':'08-05  15:36','content':'五粮液要出吗？27.87的本。'},
            {'name':'游客4256','time':'08-01  18:22','content':'上海医药 19元的本，后面如操作呢？','replay':'从股价角度，你被深套；目前位置不宜割肉；当长线投资吧，后续股价企稳后，等反弹中减仓'},
            {'name':'游客7811','time':'08-01  09:30','content':'ST金化600722可以补仓吗？'},
            {'name':'游客3568','time':'07-28  22:23','content':'中能电气 下步如何操作','replay':'不买进，市场还未企稳'},
            {'name':'游客4523','time':'07-18  12:30','content':'请问老师国星光电后市如何操作'},
            {'name':'游客7823','time':'07-18  19:16','content':'603227 这股深套，还能'},
            {'name':'游客3458','time':'07-01  17:33','content':'老师上工申贝深套，后市如何操作'},
            {'name':'游客0259','time':'06-28  17:12','content':'请问老师市北高新后市如何操作'},
            {'name':'游客6934','time':'06-20  11:10','content':'航天工程 最近行情，是否能继续持有？','replay':'前市场不稳定  控制仓位  快进快出'},
            {'name':'游客4583','time':'06-18  15:46','content':'永泰能源 现在可以再买进吗？前期5.6买进'},
        ],
        [
            {'name':'游客1526','time':'08-10  17:36','content':'众和股份002070帮忙看一下这个股跌到最低没有，23的本。能加仓吗？','replay':'目前这个位置，建议仓位轻点，不要急着补仓。轻仓参与，待市场情绪恢复后再观察'},
            {'name':'游客5356','time':'08-10  16:22','content':'老师东方电器一直流出，如何操作？'},
            {'name':'游客4511','time':'08-08  09:30','content':'敦煌种业600354老师这个开盘会升吗停了快一个月了'},
            {'name':'游客0674','time':'08-01  22:23','content':'请问老师，长城电工后市如何？今天可以抄底嘛？'},
            {'name':'游客5532','time':'07-18  19:30','content':'华自科技300490短期内怎么样'},
            {'name':'游客3242','time':'07-18  22:16','content':'000402可以补仓吗'},
            {'name':'游客2254','time':'07-01  17:33','content':'300253 短期内怎么样，'},
            {'name':'游客1862','time':'06-28  15:12','content':'爱尔眼科还可以继续持有吗','replay':'不建议补仓，市场还没稳定'},
            {'name':'游客0525','time':'06-16  11:10','content':'老师，八一后市如何？怎么听说要退市了，还能持有吗？'},
            {'name':'游客0582','time':'06-15  19:46','content':'今天会不会低开'},
        ],
        [
            {'name':'游客1526','time':'08-06  15:36','content':'荣盛发展 10元本，后面如何操作'},
            {'name':'游客5356','time':'08-02  18:22','content':'珠江实业和雄韬股份今天怎操作?满仓老师','replay':'市值也不大，可持有'},
            {'name':'游客4511','time':'08-01  09:30','content':'请问老师建新矿业也能否抄底，感谢'},
            {'name':'游客0674','time':'07-28  22:23','content':'禾嘉股份600093)这个股票18.5的成本，如何解套啊，现在就是装死'},
            {'name':'游客5532','time':'07-18  12:30','content':'002273老师，这股近期会反弹吗！31.5的本'},
            {'name':'游客3242','time':'07-18  19:16','content':'新兴铸管000778 7.5的本，后期怎么操作?','replay':' 降低成本，趋势没走坏，可进一步观察'},
            {'name':'游客2254','time':'07-01  17:33','content':'请问隆基机械后市如何？'},
            {'name':'游客1862','time':'06-28  17:12','content':'重庆港九和华远地产今天怎么操作？压力位是多少？谢谢老师！求解答'},
            {'name':'游客0525','time':'06-19  11:10','content':'300033请问这支股怎么样？什么时候是买点？','replay':'趋势不好，建议注意风险'},
        ],
        [
            {'name':'游客1526','time':'08-12  15:36','content':'盛和资源请问一下今天涨停打开了，要不要出，压力位是多少，谢谢了','replay':'市值也不大，可持有'},
            {'name':'游客5356','time':'08-06  19:22','content':'钢铁板块有利空吗？要割肉吗？还是持有等待啊'},
            {'name':'游客4511','time':'07-31  08:30','content':'002671 近期有利好？'},
            {'name':'游客0674','time':'07-28  20:23','content':'哈高科怎样操作，谢谢'},
            {'name':'游客5532','time':'07-18  14:30','content':'金地集团 可以接吗 谢谢'},
            {'name':'游客3242','time':'07-18  26:16','content':'600094大名城，就是真的很烂！','replay':'表现不佳，只能等'},
            {'name':'游客2254','time':'07-01  13:33','content':'巨力索具6.25成本，今天没补仓，明天怎么操作呢老师建议一下','replay':'先等着吧，等企稳后补仓'},
            {'name':'游客1862','time':'06-28  12:12','content':'广聚能源000096如何操作？'},
            {'name':'游客0525','time':'06-19  13:10','content':'赛轮金宇还能持有吗？套了10个点'},
        ],
        [
            {'name':'游客1526','time':'08-12  16:36','content':'际华集团这支票怎么操作12.4的本'},
            {'name':'游客5356','time':'08-04  16:22','content':'中航资本该股已跌破股灾期间低价，可否介入?另外该股与吉新科技哪个形态更好些?'},
            {'name':'游客4511','time':'07-29  09:30','content':'国投新集，这个股票我目前亏损30%，后续怎么样？可以继续持有吗？','replay':'场风险较大，不要赌明天后天，等待市场企稳后'},
            {'name':'游客0674','time':'07-27  22:23','content':'金力泰今后走势怎么样'},
            {'name':'游客5532','time':'07-20  19:30','content':'保税科技，6块成本，短线走势如何'},
            {'name':'游客3242','time':'07-18  22:16','content':'山煤国际 这只股票怎样？'},
            {'name':'游客2254','time':'07-01  17:33','content':'老师，300154今天如何操作？您每天低点和高点一般能不能提前告知呢？','replay':'目前不好操作'},
            {'name':'游客1862','time':'06-28  15:12','content':'000926请问后市怎么走，谢谢。'},
            {'name':'游客0525','time':'06-19  11:10','content':'华凌华凌钢铁，刚好3.61的本，下午出吗？','replay':'可以'},
            {'name':'游客0582','time':'06-18  12:46','content':'300494盛天网络开板了，流入很多。今天能不能买。要是你，买不买。'},
            {'name':'游客0582','time':'06-17  19:46','content':'老师你好我现在手上是银河电子,24.5元的本，和江苏索普，11.3的本，后市怎么操作？','replay':'如果后续有效企稳在12元左右，可考虑介入'},
            {'name':'游客0525','time':'06-11  22:10','content':'双良节能 10.50元进的现在怎么操作，请老师指点'},
            {'name':'游客0582','time':'06-11  19:46','content':'600360 请问后市怎么走塮谢。'},
            {'name':'游客0582','time':'06-15  15:46','content':'老师，兔宝宝现在可以买入吗？近期走势如何？'},
        ],
        [
            {'name':'游客1526','time':'08-11  17:36','content':'我想进四川金顶安全吗？'},
            {'name':'游客5356','time':'08-11  16:22','content':'老师您好，能帮我看一看万家乐这支票可以上车吗？什么价位上。谢谢'},
            {'name':'游客4511','time':'08-02  09:30','content':'贵糖股份是不是有走弱迹象呀，现在是出还是继续持有','replay':'市值看想象空间不大，只有交易性的机会'},
            {'name':'游客0674','time':'08-01  22:23','content':'请问老师辽宁成大今天可以进吗'},
            {'name':'游客5532','time':'07-27  19:30','content':'仙琚制药请问11.65元可以进吗。后期发展如何，止盈止损多少，谢谢','replay':'市场风险较大，不要赌明天后天，等待市场企稳后'},
            {'name':'游客3242','time':'07-11  12:16','content':'000576你好老师今天这只股票是主力震仓回调吗？可不可以跟进?手里原有的是继续持有还是尽快离场?'},
            {'name':'游客2254','time':'07-09  17:33','content':'老师，002657这票后市走势如何，80的本，怎么操作好','replay':'经过前几天的大跌，存在一批更加安全的调整到位个股；'},
            {'name':'游客1862','time':'06-22  15:12','content':'300168 这个股票多少钱有压力老师？'},

        ],
    ]
    function GetQueryString(name) {
        var reg = new RegExp("(^|&)" + name + "=([^&]*)(&|$)","i");
        var r = window.location.search.substr(1).match(reg);
        if (r!=null) return (r[2]); return null;
    }
    var index = GetQueryString("index")-1;
    var player = new CloudVodPlayer();
    player.init({
        "uu": "94xiy5kak8",
        "vu": data[index].id,
        "pu": "1a0bfb09b1",
        "auto_play": 0,
        "gpcflag": 1,
        "width": "100%",
        "height": "100%",
        "lang": "zh_CN",
        "ark": "0",
        "playsinline": "0",
        "pic":'../images/'+data[index].imgUrl,
    },'video');

    //$('.video img').attr('src','http://beems.91bee.com/image/'+data[index].imgUrl);
    var html = ' <h2 class="title">'
        +data[index].title
        +'</h2><p><span class="name">'
        +data[index].name
        +'</span>'
        +'<span class="time">时长 '
        +data[index].time
        +'</span></p><div>'
    $('.info').html(html);
    var question = result[index];
    console.log(question.length);
    var txt = "";
    txt += ' <ul>';
    for(var i=0;i<question.length;i++){
        txt += '<li class="mess-item clearfix">'+
            '                     <div class="f_left head-img">'+
            '                         <img src="../images/user.png" alt="头像"/>'+
            '                     </div>'+
            '                     <div class="text f_right">'+
            '                         <p class="title clearfix"><span class="name f_left">'+question[i]["name"]+'</span><span class="time f_right">'+question[i]["time"]+'</span></p>'+
            '                         <p class="descript">'+question[i]["content"]+'</p>'

        if(question[i]["replay"]){
        txt +=  '                         <div class="replay">'+
            '                             <span class="name">管理员</span><span>&nbsp;回复：</span><span>'+question[i]["replay"]+'</span>'+
            '                         </div>'+
            '                     </div>'
        }

      txt += '</li>';;
    }

    txt += ' </ul>';
     $('.messbox').html(txt);
    var myScroll = new IScroll('#wrapper', { probeType: 3, mouseWheel: true });
    $('#askInput').focus(function(){
        $(this).val('');
    })
    $('#sendBtn').click(function(){
        var str = $('#askInput').val();
        //str = ltrim(str);
        if(isNullOrEmpty(str)){
            layer.open({
                content: '输入的内容不能为空!'
                ,skin: 'msg'
                ,time: 2
            });
        }else{
            var askTxt = $('#askInput').val();
            var appendTxt = "";
            appendTxt += '<li class="mess-item clearfix">'
            appendTxt += '<div class="f_left head-img">'
            appendTxt += '<img src="../images/user.png" alt="头像"/>'
            appendTxt += '</div>'
            appendTxt += '<div class="text f_right">'
            appendTxt += '<p class="title clearfix"><span class="name f_left">游客8668</span><span class="time f_right">刚刚</span></p>'
            appendTxt += '<p class="descript">'+askTxt+'</p>'
            appendTxt += '</div>'
            appendTxt += '</li>'
            $('.messbox ul').prepend(appendTxt);
        }
        $('#askInput').val('');
        myScroll.refresh();
        myScroll.scrollTo(0,0)
    })


    function ltrim(str){ //删除左边的空格
     　     return str.replace(/(^\s*)/g,"");
     　 }

    function isNullOrEmpty(strVal) {
        if (strVal == '' || strVal == null || strVal == undefined||strVal == ' ') {
            return true;
        } else {
            return false;
        }
    }
})


